lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.h
/*
 * Copyright 2020, 2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _I3C_COMPONENT_H_
#define _I3C_COMPONENT_H_

#include "fsl_component_generic_list.h"

/*!
 * @addtogroup I3C_Bus_Component
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name I3C BUS management definitions*/
/*@{*/
#define I3C_BUS_MAX_DEVS                          11U   /*!< Bus maximum device count. */
#define I3C_BUS_HOT_JOIN_ADDR                     0x2U  /*!< Hot join event device address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR1 0x3EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR2 0x5EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR3 0x6EU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR4 0x76U /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR5 0x7AU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR6 0x7CU /*!< Broadcast address single bit error detect address. */
#define I3C_BOARDCAST_SINGLE_BIT_ERR_DETECT_ADDR7 0x7FU /*!< Broadcast address single bit error detect address. */
#define I3C_BUS_BROADCAST_ADDR                    0x7EU /*!< Broad cast address. */
#define I3C_BUS_MAX_ADDR                          0x7FU /*!< Maximum address allowed for address assignment. */
#define I3C_BUS_ADDR_SLOTWIDTH                    2U  /*!< Address slot width used in address management in bus pool. */
#define I3C_BUS_ADDR_SLOTDEPTH                    32U /*!< Address slot depth used in address management in bus pool. */
#define I3C_BUS_ADDR_SLOTMASK                     3U  /*!< Address slot mask used in address management in bus pool. */

/*@}*/

/*! @name I3C BUS CCC (Common Command Codes) definitions*/
/*@{*/
#define I3C_BUS_CCC_DIRECT_PREFIX 0x80U /*!< Prefix used for direct access CCC. */

#define I3C_BUS_CCC(cmdID, isDirect) \
    ((cmdID) | ((isDirect) ? I3C_BUS_CCC_DIRECT_PREFIX : 0U)) /*!< CCC ID calculation. */

/* CCC available for both broadcast and direct access */
#define I3C_BUS_CCC_ENEC(isDirect)      I3C_BUS_CCC(0x0U, isDirect)        /*!< Enable Slave Events Command. */
#define I3C_BUS_CCC_DISEC(isDirect)     I3C_BUS_CCC(0x1U, isDirect)        /*!< Disable Slave Events Command. */
#define I3C_BUS_CCC_ENTAS(as, isDirect) I3C_BUS_CCC(0x2U + (as), isDirect) /*!< Enter Activity State 0–3 Command. */
#define I3C_BUS_CCC_RSTDAA(isDirect)    I3C_BUS_CCC(0x6U, isDirect) /*!< Reset Dynamic Address Assignment Command. */
#define I3C_BUS_CCC_SETMWL(isDirect)    I3C_BUS_CCC(0x9U, isDirect) /*!< Set Max Write Length Command. */
#define I3C_BUS_CCC_SETMRL(isDirect)    I3C_BUS_CCC(0xaU, isDirect) /*!< Set Max Read Length Command. */
#define I3C_BUS_CCC_SETXTIME(isDirect)  (isDirect) ? 0x98U : 0x28U  /*!< Set Exchange Timing Information Command. */
#define I3C_BUS_CCC_VENDOR_EXT(cmdID, isDirect) \
    ((cmdID) + ((isDirect) ? 0xe0U : 0x61U))                        /*!< Vendor Extension Command. */

/* CCC available only for broadcast access */
#define I3C_BUS_CCC_ENTDAA    0x7U        /*!< Enter Dynamic Address Assignment Command. */
#define I3C_BUS_CCC_DEFSLVS   0x8U        /*!< Send Define List of Slaves Command. */
#define I3C_BUS_CCC_ENTTM     0xbU        /*!< Enter Test Mode Command. */
#define I3C_BUS_CCC_ENTHDR(x) 0x20U + (x) /*!< Enter HDR Command. */

/* CCC available only for direct access */
#define I3C_BUS_CCC_SETDASA   0x87U /*!< Set Dynamic Address from Static Address Command. */
#define I3C_BUS_CCC_SETNEWDA  0x88U /*!< Set New Dynamic Address Command. */
#define I3C_BUS_CCC_GETMWL    0x8bU /*!< Get Max Write Length Command. */
#define I3C_BUS_CCC_GETMRL    0x8cU /*!< Get Max Read Length Command. */
#define I3C_BUS_CCC_GETPID    0x8dU /*!< Get Provisional ID Command. */
#define I3C_BUS_CCC_GETBCR    0x8eU /*!< Get BCR Command. */
#define I3C_BUS_CCC_GETDCR    0x8fU /*!< Get DCR Command. */
#define I3C_BUS_CCC_GETSTATUS 0x90U /*!< Get Device Status Command. */
#define I3C_BUS_CCC_GETACCMST 0x91U /*!< Get Accept Mastership Command. */
#define I3C_BUS_CCC_SETBRGTGT 0x93U /*!< Set Bridge Targets Command. */
#define I3C_BUS_CCC_GETMXDS   0x94U /*!< Get Max Data Speed Command. */
#define I3C_BUS_CCC_GETHDRCAP 0x95U /*!< Get HDR Capability Command. */
#define I3C_BUS_CCC_GETXTIME  0x99U /*!< Get Exchange Timing Support Command. */

/*@}*/

/*! @name I3C device BCR register bit masks*/
/*@{*/

/* @brief I3C device bus characteristics */
#define I3C_BUS_DEV_BCR_DEV_MASTER     0x01U
#define I3C_BUS_DEV_BCR_DEV_ROLE_SHIFT 6U
#define I3C_BUS_DEV_BCR_DEV_ROLE_MASK  0xC0U
#define I3C_BUS_DEV_BCR_DEV_ROLE(x)    (((x) << I3C_BUS_DEV_BCR_DEV_ROLE_SHIFT) & I3C_BUS_DEV_BCR_DEV_ROLE_MASK)

#define I3C_BUS_DEV_BCR_MODE_SHIFT 5U
#define I3C_BUS_DEV_BCR_MODE_MASK  0x20U
#define I3C_BUS_DEV_BCR_MODE(x)    (((x) << I3C_BUS_DEV_BCR_MODE_SHIFT) & I3C_BUS_DEV_BCR_MODE_MASK)

#define I3C_BUS_DEV_BCR_IBI_PAYLOAD_SHIFT 2U
#define I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK  0x04U
#define I3C_BUS_DEV_BCR_IBI_PAYLOAD(x)    (((x) << I3C_BUS_DEV_BCR_IBI_PAYLOAD_SHIFT) & I3C_BUS_DEV_BCR_IBI_PAYLOAD_MASK)

#define I3C_BUS_DEV_BCR_IBI_REQUEST_SHIFT 1U
#define I3C_BUS_DEV_BCR_IBI_REQUEST_MASK  0x02U
#define I3C_BUS_DEV_BCR_IBI_REQUEST(x)    (((x) << I3C_BUS_DEV_BCR_IBI_REQUEST_SHIFT) & I3C_BUS_DEV_BCR_IBI_REQUEST_MASK)

#define I3C_BUS_DEV_BCR_SPEED_LIMIT_SHIFT 0U
#define I3C_BUS_DEV_BCR_SPEED_LIMIT_MASK  0x01U
#define I3C_BUS_DEV_BCR_SPEED_LIMIT(x)    (((x) << I3C_BUS_DEV_BCR_SPEED_LIMIT_SHIFT) & I3C_BUS_DEV_BCR_SPEED_LIMIT_MASK)

/*@}*/

/*! @brief I3C Bus status. */
enum
{
    kStatus_I3CBus_Success         = kStatus_Success,                      /*!< I3C Bus operation succeed*/
    kStatus_I3CBus_AddrSlotInvalid = MAKE_STATUS(kStatusGroup_I3CBUS, 0U), /*!< I3C Bus address slot invalid */
    kStatus_I3CBus_MasterOpsUnsupport =
        MAKE_STATUS(kStatusGroup_I3CBUS, 1U),                              /*!< I3C Bus master operation unsupported */
    kStatus_I3CBus_NotCurrentMaster = MAKE_STATUS(
        kStatusGroup_I3CBUS, 2U), /*!< The Bus operation should be made on master but current device is not master */
    kStatus_I3CBus_MasterOpsFailure   = MAKE_STATUS(kStatusGroup_I3CBUS, 3U), /*!< Bus operation failure */
    kStatus_I3CBus_InvalidOps         = MAKE_STATUS(kStatusGroup_I3CBUS, 4U), /*!< Master transfer timeout on bus */
    kStatus_I3CBus_MasterTransTimeout = MAKE_STATUS(kStatusGroup_I3CBUS, 5U), /*!< Master transfer timeout on bus */
    kStatus_I3CBus_SlaveOpsNotSupported =
        MAKE_STATUS(kStatusGroup_I3CBUS, 6U), /*!< I3C Bus slave operation unsupported */
    kStatus_I3CBus_MasterOpsMissing =
        MAKE_STATUS(kStatusGroup_I3CBUS, 7U), /*!< I3C Bus master mandatory operation missing */
};

/*! @brief I3C bus events. */
enum _i3c_bus_events
{
    kI3C_EventIBI = 1U, /*!< I3C Bus event IBI */
    kI3C_EventMR  = 2U, /*!< I3C Bus event Mastership Request */
    kI3C_EventHJ  = 8U, /*!< I3C Bus event Hot Join */
};

/*! @brief I3C device information. */
typedef struct _i3c_device_information
{
    uint8_t dynamicAddr;     /*!< Device dynamic address. */
    uint8_t staticAddr;      /*!< Static address. */
    uint8_t dcr;             /*!< Device characteristics register information. */
    uint8_t bcr;             /*!< Bus characteristics register information. */
    uint16_t vendorID;       /*!< Device vendor ID(manufacture ID). */
    uint32_t partNumber;     /*!< Device part number info */
    uint16_t maxReadLength;  /*!< Maximum read length. */
    uint16_t maxWriteLength; /*!< Maximum write length. */
    uint8_t maxIBILength;    /*!< Maximum ibi payload length. */
    uint8_t hdrMode;         /*!< Support hdr mode, could be OR logic in i3c_hdr_mode. */
} i3c_device_information_t;

