lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.h
/* Forward declaration of the i3c_bus_t typedef. */
typedef struct _i3c_bus i3c_bus_t;

/* Forward declaration of the i3c_device_control_info_t typedef. */
typedef struct _i3c_device_control_info i3c_device_control_info_t;

/* Forward declaration of the i3c_device_ibi_info_t typedef. */
typedef struct _i3c_device_ibi_info i3c_device_ibi_info_t;

/*! @brief I3C device definition. */
typedef struct _i3c_device
{
    list_element_t listNode;                   /*!< list node to link i3c devices in i3c bus. */
    i3c_bus_t *bus;                            /*!< I3C bus pointer, points to current bus the device is attached. */
    i3c_device_control_info_t *devControlInfo; /*!< Pointer to control information structure of the device. */
    i3c_device_information_t info;             /*!< Pointer to device information structure of the device. */
    uint8_t initDynamicAddr;                   /*!< Initial dynamic address for the device. */
    i3c_device_ibi_info_t *ibiInfo;            /*!< Pointer to IBI request information structure of the device. */
} i3c_device_t;

/* Forward declaration of the i2c_device_control_info_t typedef. */
typedef struct _i2c_device_control_info i2c_device_control_info_t;

/*! @brief I2C device definition. */
typedef struct _i2c_device
{
    list_element_t listNode;                   /*!< list node to link i2c devices in i3c bus. */
    i3c_bus_t *bus;                            /*!< I3C bus pointer, points to current bus the device is attached. */
    i2c_device_control_info_t *devControlInfo; /*!< Pointer to device information structure of the device. */
    uint8_t staticAddr;                        /*!< static address for I2C device. */
    uint8_t lvr;                               /*!< LVR for I2C device. */
} i2c_device_t;

/*! @brief CCC command structure for CCC frame */
typedef struct _i3c_ccc_cmd
{
    uint8_t cmdId;     /*!< Command ID. */
    bool isRead;       /*!< Read command or write command. */
    uint8_t destAddr;  /*!< Destination address for the command, broadcast uses 0x7E, direct access uses dest device
                          dynamic address. */
    void *data;        /*!< Pointer to data to be transmitted or received. */
    uint16_t dataSize; /*!< Data size of data to be transmitted or received. */
} i3c_ccc_cmd_t;

/*! @brief I3C bus transfer structure for general data transfer. */
typedef struct _i3c_bus_transfer
{
    uint32_t regAddr;     /*!< Operate register address of the target device.*/
    uint32_t regAddrSize; /*!< Size of Register address. */
    bool isRead;          /*!< Read transfer or write transfer. */
    void *data;           /*!< Pointer to data to be transmitted or received. */
    uint32_t dataSize;    /*!< Data size of data to be transmitted or received. */
} i3c_bus_transfer_t;

/*! @brief I3C device hardware operation API set. */
typedef struct i3c_device_hw_ops
{
    status_t (*Init)(i3c_device_t *dev);          /*!< Init function to initialize I3C device.*/
    void (*Deinit)(i3c_device_t *dev);            /*!< Deinit function to de-initialize I3C device.*/
    status_t (*ProceedDAA)(i3c_device_t *master); /*!< ProceedDAA function, only required for I3C master device.*/
    bool (*CheckSupportCCC)(i3c_device_t *master, i3c_ccc_cmd_t *cmd); /*!< CheckSupportCCC function, optional for I3C
                                                                          master device, not require for slave device.*/
    status_t (*TransmitCCC)(i3c_device_t *master,
                            i3c_ccc_cmd_t *cmd);      /*!< TransmitCCC function, only require for I3C master device.*/
    status_t (*DoI3CTransfer)(
        i3c_device_t *dev, i3c_bus_transfer_t *xfer); /*!< DoI3CTransfer function, only require for I3C master device.*/
    status_t (*DoI2CTransfer)(
        i2c_device_t *dev, i3c_bus_transfer_t *xfer); /*!< DoI2CTransfer function, only require for I3C slave device.*/
    void (*HotJoin)(i3c_device_t *master);            /*!< HotJoin function.*/
    void (*RequestMastership)(
        i3c_device_t *master); /*!< RequestMastership function, only require for I3C master device.*/
    void (*RegisterIBI)(i3c_device_t *master, uint8_t ibiAddress); /*!< Register IBI address with mandatory byte.*/
    void (*RequestIBI)(i3c_device_t *device, void *data, size_t dataSize); /*!< RequestIBI function.*/
} i3c_device_hw_ops_t;

/*! @brief I3C device information. */
struct _i3c_device_control_info
{
    i3c_device_hw_ops_t *funcs; /*!< Pointer to I3C device hardware operation API sets.*/
    void *resource;             /*!< Pointer to keep I3C device specific resource.*/
    bool isSecondary;           /*!< Specify if the device is secondary device.*/
    void *privateData;          /*!< Pointer to keep I3C device private data.*/
};

/*! @brief I2C device information. */
typedef struct i2c_device_hw_ops
{
    int (*Init)(i2c_device_t *dev);    /*!< I2C device initialize function.*/
    void (*Deinit)(i2c_device_t *dev); /*!< I2C device de-initialize function.*/
} i2c_device_hw_ops_t;

/*! @brief I3C master information. */
struct _i2c_device_control_info
{
    i2c_device_hw_ops_t *funcs; /*!< Pointer to I2C device hardware operation API sets.*/
    void *resource;             /*!< Pointer to keep I2C device specific resource.*/
    void *privateData;          /*!< Pointer to keep I2C device private data.*/
};

/*! @brief I3C device IBI information. */
typedef void (*i3c_dev_ibi_handler_t)(i3c_device_t *dev, const void *ibiData, uint32_t ibiLen);
struct _i3c_device_ibi_info
{
    uint32_t maxPayloadLength;        /*!< maximum IBI payload length. */
    bool enabled;                     /*!< is IBI enabled. */
    i3c_dev_ibi_handler_t ibiHandler; /*!< IBI handler when device registers IBI. */
};

/*! @brief I3C bus mode definition. */
typedef enum _i3c_bus_mode
{
    kI3C_Bus_PureMode,       /*!< only I3C devices are connected to the bus */
    kI3C_Bus_MixedMode_Fast, /*!<  I2C devices with 50ns spike filter are present on bus */
    kI3C_Bus_MixedMode_Slow, /*!<  I2C devices without 50ns spike filter are present on bus */
} i3c_bus_mode_t;

/*! @brief I3C address slot status in address pool. */
typedef enum _i3c_addr_slot_status
{
    kI3C_Bus_AddrSlot_Free = 0, /*!< Address slot is free. */
    kI3C_Bus_AddrSlot_Reserved, /*!< Address slot is reserved. */
    kI3C_Bus_AddrSlot_I2CDev,   /*!< Address slot is I2C device. */
    kI3C_Bus_AddrSlot_I3CDev,   /*!< Address slot is I3C device. */
} i3c_addr_slot_status_t;

/*! @brief I3C initial bus configuration, user input to configure. */
typedef struct _i3c_bus_config
{
    i3c_bus_mode_t busMode;        /*!< Bus mode. */
    uint32_t i2cBaudRate;          /*!< I2C baud rate. */
    uint32_t i3cOpenDrainBaudRate; /*!< I3C open drain baudrate. */
    uint32_t i3cPushPullBaudRate;  /*!< I3C push-pull baudrate. */
} i3c_bus_config_t;

