lizhi98/SmartCar_RT1064/MCXVision/libraries/mcxn947_dfp/components/i3c_bus/fsl_component_i3c.h
/*! @brief I3C bus structure, contains bus mandatory informations.*/
struct _i3c_bus
{
    i3c_device_t *volatile currentMaster;       /*!< Pointer to current I3C master on bus. */
    uint32_t addrSlots[((I3C_BUS_MAX_ADDR + 1U) * I3C_BUS_ADDR_SLOTWIDTH) /
                       I3C_BUS_ADDR_SLOTDEPTH]; /*!< I3C bus address pool. */
    i3c_bus_mode_t busMode;                     /*!< I3C bus mode. */
    uint32_t i2cBaudRate;                       /*!< I2C baud rate. */
    uint32_t i3cOpenDrainBaudRate;              /*!< I3C open drain baudrate. */
    uint32_t i3cPushPullBaudRate;               /*!< I3C push-pull baudrate. */
    list_label_t i2cDevList;                    /*!< I2C device list. */
    list_label_t i3cDevList;                    /*!< I3C device list. */
};

/*! @brief Device description structure in I3C DEFSLVS device list .*/
typedef struct _i3c_ccc_dev
{
    uint8_t dynamicAddr; /*!< Dynamic address for I3C device. */
    union
    {
        uint8_t dcr;    /*!< Device Characteristics register value for I3C device. */
        uint8_t lvr;    /*!< Legacy Virtual Register value for I2C device */
    };
    uint8_t bcr;        /*!< Bus characteristics register value. */
    uint8_t staticAddr; /*!< Static address for I3C/I2C device. */
} i3c_ccc_dev_t;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif /* _cplusplus */

/*!
 * @name I3C bus operation
 * @{
 */

/*!
 * @brief Gets the default configuration structure.
 *
 * This function initializes the bus configuration structure to a default value. The default
 * values are:
 *   busConfig->busMode = kI3C_Bus_PureMode;
 *   busConfig->i2cBaudRate = 400000U;
 *   busConfig->i3cOpenDrainBaudRate = 1500000U;
 *   busConfig->i3cPushPullBaudRate = 4000000U;
 *
 * @param config Pointer to a configuration structure.
 */
void I3C_BusGetDefaultBusConfig(i3c_bus_config_t *busConfig);

/*!
 * @brief Creates I3C bus structure.
 *
 * This function creates the bus structure with input bus configuration. Address pool set up and device
 * list initialize process will be also done in this function call.
 *
 * @param bus Pointer to bus structure.
 * @param busConfig Pointer to the bus configuration structure.
 */
void I3C_BusCreate(i3c_bus_t *bus, const i3c_bus_config_t *busConfig);

/*!
 * @brief Get valid address slot in the I3C bus.
 *
 * This function will search for available address lot in the I3C bus address pool, the search starts from
 * the startAddr specified by user input, to end address defined in @ref I3C_BUS_MAX_ADDR. Will return the
 * available address if the related address slot is valid.
 *
 * @param bus Pointer to bus structure.
 * @param startAddr Start address for address slot searching, end address is defined in @ref I3C_BUS_MAX_ADDR.
 * @return Available address in the bus address pool.
 */
uint8_t I3C_BusGetValidAddrSlot(i3c_bus_t *bus, uint8_t startAddr);

/*!
 * @brief Set address slot status.
 *
 * This function will set an specified address to address slot and set the status.
 *
 * @param bus Pointer to bus structure.
 * @param addr address to be used.
 * @return status the address status of @ref i3c_addr_slot_status_t.
 */
void I3C_BusSetAddrSlot(i3c_bus_t *bus, uint8_t addr, i3c_addr_slot_status_t status);

/*!
 * @brief Add exist I3C device in bus to the bus device list.
 *
 * This function will simply add the device to the bus device list and set the related address slot.
 *
 * @param bus Pointer to bus structure.
 * @param dev Pointer to I3C device.
 */
void I3C_BusAddI3CDev(i3c_bus_t *bus, i3c_device_t *dev);

/*!
 * @brief Add exist I2C device in bus to the bus device list.
 *
 * This function will simply add the device to the bus device list and set the related address slot.
 *
 * @param bus Pointer to bus structure.
 * @param dev Pointer to I2C device.
 */
void I3C_BusAddI2CDev(i3c_bus_t *bus, i2c_device_t *dev);

/* @} */

/*!
 * @name I3C bus master operation
 * @{
 */

/*!
 * @brief Create I3C master structure on bus.
 *
 * This function will create I3C master bus structure, initialize the master according to bus characteristics, install
 * device information and device control information.
 *
 * @param masterDev Pointer to device structure creating as master.
 * @param bus Pointer to bus structure.
 * @param devInfo Pointer to device information structure.
 * @param masterControlInfo Pointer to master control information structure.
 */
status_t I3C_BusMasterCreate(i3c_device_t *masterDev,
                             i3c_bus_t *bus,
                             i3c_device_information_t *devInfo,
                             i3c_device_control_info_t *masterControlInfo);

/*!
 * @brief Register slave IBI information to bus master.
 *
 * This function will register the slave IBI information to bus master so that bus master know how
 * to handle slave IBI event.
 *
 * @param masterDev Pointer to device structure creating as master.
 * @param i3cDev Pointer to the I3C device master want to register.
 * @param devIbiInfo Pointer to device IBI information structure.
 */
status_t I3C_BusMasterRegisterDevIBI(i3c_device_t *masterDev, i3c_device_t *i3cDev, i3c_device_ibi_info_t *devIbiInfo);

/*!
 * @brief Bus master transfer CCC frame.
 *
 * Bus master call this function to transfer CCC frame, CCC frame command and data is prepared in @ref i3c_ccc_cmd_t
 * structure.
 *
 * @param masterDev Pointer to I3C master device.
 * @param command Pointer to ccc frame.
 */
status_t I3C_BusMasterSendCCC(i3c_device_t *masterDev, i3c_ccc_cmd_t *command);

/*!
 * @brief Bus master reset dynamic assigned address.
 *
 * Bus master call this function to reset dynamic assigned address, the operation could be done to all connected I3C
 * devices by using slave address I3C_BUS_BROADCAST_ADDR or to a specific connected device by using the device's dynamic
 * address.
 *
 * @param masterDev Pointer to I3C master device.
 * @param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 */
status_t I3C_BusMasterResetDAA(i3c_device_t *masterDev, uint8_t slaveAddr);

/*!
 * @brief Bus master do dynamic address assignment.
 *
 * Bus master call this function to do dynamic address assignment to the I3C devices connected on bus.
 *
 * @param masterDev Pointer to I3C master device.
 */
status_t I3C_BusMasterDoDAA(i3c_device_t *masterDev);

/*!
 * @brief Bus master set device dynamic address from static address.
 *
 * Bus master call this function to execute SETDASA CCC command to set device dynamic address from static address.
 *
 * @param masterDev Pointer to I3C master device.
 * @param staticAddr Device static address.
 * @param initDynamicAddr Device initialized dynamic address.
 */
status_t I3C_BusMasterSetDynamicAddrFromStaticAddr(i3c_device_t *master, uint8_t staticAddr, uint8_t initDynamicAddr);

/*!
 * @brief Bus master send slave list on bus.
 *
 * Bus master call this function to send slave list on bus to notify the secondary master.
 *
 * @param masterDev Pointer to I3C master device.
 */
status_t I3C_BusMasterSendSlavesList(i3c_device_t *masterDev);

/*!
 * @brief Bus master handle in-band-interrupt event.
 *
 * Bus master call this function to handle in-band-interrupt event.
 *
 * @param masterDev Pointer to I3C master device.
 * @param ibiAddress slave address which requests the IBI.
 * @param ibiData Pointer to the ibi data buffer.
 * @param payloadSize ibi data buffer size.
 */
status_t I3C_BusMasterHandleIBI(i3c_device_t *masterDev, uint8_t ibiAddress, void *ibiData, uint32_t payloadSize);

/*!
 * @brief Bus master do data transfer to I2C device.
 *
 * Bus master call this function to transfer data to connected I2C device.
 *
 * @param masterDev Pointer to I3C master device.
 * @param i2cDev Pointer to the I2C device master do transfer.
 * @param xfer Pointer to bus transfer.
 */
status_t I3C_BusMasterDoTransferToI2CDev(i3c_device_t *masterDev, i2c_device_t *i2cDev, i3c_bus_transfer_t *xfer);

/*!
 * @brief Bus master do data transfer to I3C device.
 *
 * Bus master call this function to transfer data to connected I3C device.
 *
 * @param masterDev Pointer to I3C master device.
 * @param i3cDev Pointer to the I3C device master do transfer.
 * @param xfer Pointer to bus transfer.
 */
status_t I3C_BusMasterDoTransferToI3CDev(i3c_device_t *masterDev, i3c_device_t *i3cDev, i3c_bus_transfer_t *xfer);

/*!
 * @brief Bus master enable events.
 *
 * Bus master call this function to enable events on bus.
 *
 * @param masterDev Pointer to I3C master device.
 * @param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 * @param busEvents Logic OR or member in @ref _i3c_bus_events.
 */
status_t I3C_BusMasterEnableEvents(i3c_device_t *masterDev, uint8_t slaveAddr, uint8_t busEvents);

/*!
 * @brief Bus master disable events.
 *
 * Bus master call this function to disable events on bus.
 *
 * @param masterDev Pointer to I3C master device.
 * @param slaveAddr Slave address, use I3C_BUS_BROADCAST_ADDR as broadcast address.
 * @param busEvents Logic OR or member in @ref _i3c_bus_events.
 */
status_t I3C_BusMasterDisableEvents(i3c_device_t *masterDev, uint8_t slaveAddr, uint8_t busEvents);

/*!
 * @brief Bus master get device information for a specific I3C device.
 *
 * Bus master call this function to get device information for a specific I3C device.
 *
 * @param masterDev Pointer to I3C master device.
 * @param slaveAddr Slave address, dynamic assigned address for a device.
 * @param devInfo Input pointer to structure i3c_device_information_t to store the read out device information.
 */
status_t I3C_BusMasterGetDeviceInfo(i3c_device_t *masterDev, uint8_t slaveAddr, i3c_device_information_t *devInfo);

/* @} */

/*!
 * @name I3C bus slave operation
 * @{
 */

/*!
 * @brief Create I2C slave structure on bus.
 *
 * This function will create I2C device bus structure, initialize the slave according to bus characteristics, install
 * device information including static address, lvr and device control information.
 *
 * @param i2cDev Pointer to device structure creating as I2C device.
 * @param bus Pointer to bus structure.
 * @param staticAddr Static address of the I2C device
 * @param lvr legacy virtual register value of the device.
 * @param devControlInfo Pointer to device control information structure.
 */
status_t I3C_BusI2CSlaveCreate(
    i2c_device_t *i2cDev, i3c_bus_t *bus, uint8_t staticAddr, uint8_t lvr, i2c_device_control_info_t *devControlInfo);

/*!
 * @brief Create I3C slave structure on bus.
 *
 * This function will create I3C device bus structure, initialize the slave according to bus characteristics, install
 * device information and device control information.
 *
 * @param i3cDev Pointer to device structure creating as I3C device.
 * @param bus Pointer to bus structure.
 * @param devInfo Pointer to device information structure
 * @param devControlInfo Pointer to device control information structure.
 */
status_t I3C_BusI3CSlaveCreate(i3c_device_t *i3cDev,
                               i3c_bus_t *bus,
                               i3c_device_information_t *devInfo,
                               i3c_device_ibi_info_t *ibiInfo,
                               i3c_device_control_info_t *devControlInfo);

/*!
 * @brief I3C slave device request Hot Join on bus.
 *
 * @param i3cDev Pointer to device structure creating as I3C device.
 */
status_t I3C_BusSlaveRequestHotJoin(i3c_device_t *i3cDev);

/*!
 * @brief I3C slave device request mastership on bus.
 *
 * @param i3cDev Pointer to device structure creating as I3C device.
 */
status_t I3C_BusSlaveRequestMasterShip(i3c_device_t *i3cDev);

/*!
 * @brief I3C slave request IBI events.
 *
 * @param i3cDev Pointer to device structure creating as I3C device.
 * @param data Pointer to data buffer to be sent in IBI event.
 * @param dataSize data size of IBI data.
 */
status_t I3C_BusSlaveRequestIBI(i3c_device_t *i3cDev, void *data, size_t dataSize);

/* @} */

#if defined(__cplusplus)
}
#endif

/*! @}*/
#endif
